SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-60862

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
	WagonShape ( FDB_V2_60862.s )
	Size  ( 2.718m 3.79m 12.5m )
Mass ( 93.1t-uk )comment(82.7.1UKT Empty, 93.1UKT Full)
WheelRadius ( 19in )comment (Front Bogie)

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Stiffness ( 1e7N/m 1e7N/m )
			Damping ( 0.2e7N/m 0.2e7N/m )
			Break ( 710kN 1220kN )
			r0 ( 10cm 0cm )
		)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Stiffness ( 1e6N/m 2e6N/m )
			Damping ( 1e6N/m 1e6N/m )
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
Comment ( * Locomotive is steam braked * )
BrakeEquipmentType( "Vacuum_brake, Auxilary_reservoir" )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 237kN ) Comment ( * braked approx 70% of mass on driving wheels, or 55% of Weight in Working Order, coefficient of friction 0.5 * )

MaxReleaseRate ( 10inHg/s ) 
MaxApplicationRate ( 1.3inHg/s )

ORTSBrakeCylinderSize ( 6in ) Comment ( Locomotive has steam brake  )
ORTSAuxilaryResCapacity ( 0.90ft^3 ) Comment ( Vacuum reservoir used for control of steam brake )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.8m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 15.0ft 6.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 6899 )
ORTSDavis_B ( 31.33 )
ORTSDavis_C ( 5.449 )

ORTSWagonFrontalArea (102)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights	( 2
			Light	(
			comment( Front White Lamp Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
			Position ( 0.98 1.42 6.03 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
			Light	(
			comment( Front White Lamp Position D )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
			Position ( -0.98 1.42 6.03 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
		)
	
Comment( ******* Miscellaneous Wagon Information************ )

Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( FDB_V2_60862.s )
        PassengerCabinHeadPos ( 1.423 3.0 -4.7 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ("..\\..\\Common.Steam\\V2Sound\\V2eng.sms" )
)

Engine ( OR-60862

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0.269 3.95 -3.7
				0 1 0
				0.15
			)

			SafetyValvesFX
			(
				0 4 -4
				0 1 0
				0.3
			)
			SafetyValvesFX
			(
				0 4 -4.4
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.36 4.040
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.36 4.040
				0 1 0
				0.25
			)
			StackFX
			(
				0 4.36 4.040
				0 1 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.15
			)
			
			Injectors2FX
			(
				-1.074 0.98 -5.8
				0 -1 0
				0.15
			)
			Injectors1FX
			(
				1.074 0.98 -5.8
				0 -1 0
				0.15
			)
      		Comment ( == Cylinder - Right Front== )
			CylindersFX
			(
				-1.074 0.50 5.9
				0 0 1
				0.25
			)
      		Comment ( == Cylinder - Right Rear== )
			Cylinders2FX
			(
				-1.074 0.4 5.9
				0 0 1
				0.25
			)
      		Comment ( == Cylinder - Centre Front== )
			CylindersFX
			(
				0 0.50 5.9
				0 0 1
				0.25
			)
      		Comment ( == Cylinder - Centre Rear== )
			Cylinders2FX
			(
				0 0.49 5.9
				0 0 1
				0.25
			)
      		Comment ( == Cylinder - Left Front== )
			CylindersFX
			(
				1.074 0.50 5.9
				0 0 1
				0.25
			)
      		Comment ( == Cylinder - Left Rear == )
			Cylinders2FX
			(
				1.074 0.49 5.9
				0 0 1
				0.25
			)
		)
	)

Wagon ( OR-60862 )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 37in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 65.6t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 321ft^3 )  
ORTSEvaporationArea ( 2431ft^2 )
ORTSSuperheatArea ( 680ft^2 )
MaxBoilerPressure ( 220psi )
MaxSteamHeatingPressure ( 50psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 18.5in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 41.25ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 7.5t-uk )
MaxTenderWaterMass ( 42000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )

Comment(ORTSMaxIndicatedHorsepower ( 2094.0hp ))   

Comment(Kylchap Double Chimney)
ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.97 )
ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0 )
ORTSMaxSuperheatTemperature ( 300.0 )   

ORTSBoilerEfficiency( 0.0 0.91  190.0 0.455 )   
Comment(From Report)

ORTSBurnRate( 0.0 10.0   12000.0 1430.0   14000.0 1725.0   18000.0 2350.0   22000.0 3110.0   26000.0 4030.0   30000.0 5270.0   31000.0 5760.0  33000.0 8640 )   
Comment(From Report)

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
BrakesEngineBrakeType ( "Steam_brake" )Comment(steam_brake crahes OR in Brake HUD)
TrainPipeLeakRate ( 0.05inHg/s )


Comment ( *** Ejectors *** )
Comment (  Estimate for Gresham & Craven SJ type P ejector  )
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.34inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 210lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 110psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )


Comment ( == Independent Brake valve - Engine & Tender == )
EngineBrakesControllerMaxReleaseRate ( 2.0inHg/s )
EngineBrakesControllerMaxApplicationRate ( 2.0inHg/s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.65 0.65 0.01 0 
            NumNotches( 0 )		
  		)

Comment ( Locomotive brake based upon Gresham & Craven MkIV Steam Brake Valve )
Brake_Engine ( 0 1 0.25 0.0
NumNotches( 5
Notch( 0.00 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.25 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.50 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.75 0 EngineBrakesControllerBrakeNotchStart )
Notch( 1.00 0 EngineBrakesControllerBrakeNotchStart ) ) )


Comment ( Based upon Gresham & Craven SJ Ejector and control valve )
Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )


ORTSSmallEjector ( 0 1 0.1 1.0 NumNotches ( 0 ) )

Brake_Brakeman ( 0 1 0.2 0.3
NumNotches ( 1
Notch( 0 1 BrakemanBrakesControllerManualBrakingStart ) ) )

FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( V2.cvf )
HeadOut (  -1.423 3.0 -4.7 )
Sound ("..\\..\\Common.Steam\\V2Sound\\V2cab.sms" )
Name ( "60862 V2 Gresley, Class A, Kings Cross Shed 34A, Double Chimney, Steam Brake, TE 33.73Klbf" )
Description (
"A total of 184 V2s in eleven batches were built between 1936 and 1944. A further four were planned in the last batch, but Thompson had these built to his A2/1 Pacific design. The V2s were allocated to all regions of the LNER, although most were posted to sheds along the East Coast Main Line between Kings Cross and Aberdeen. The first V2, No. 4771 Green Arrow quickly became famous working the first leg of the King's Cross to Glasgow express goods. Although they were designed for this kind of express goods work, the V2s proved adaptable and occasionally substituted for the A1 & A3 Pacifics and even the streamlined A4s. During the 1960s, there were a number of trials with Kylchap blastpipe/chimney arrangements. This actually started with trials on Nos. 60817 and 60963 running with an arrangement borrowed from the LMS Royal Scot Class, rather than the LNER Pacific double chimney Kylchap arrangement. This did not give a significant performance boost, and the Kylchap arrangement was tried instead. Nos. 60817 and 60881 were fitted with Kylchap cowls in January 1961. This resulted in performances comparable to a Pacific, and the recommendation was made to convert all V2s to use this arrangement. With the imminent replacement by diesels, only eight V2s were eventually converted to use the double chimney Kylchap arrangement."
)
)
